[{"title":"Writing HTML with accessibility in mind","slug":"writing-html-with-accessibility-in-mind","teaser":"An introduction to web accessibility. Tips on how to improve your markup and provide users with more and betters ways to navigate and interact with your site.","date":"2016-12-13","year":"2016","body":"<div class=\"post__intro\">\n  An introduction to web accessibility. Tips on how to improve your markup and provide users with more and betters ways to navigate and interact with your site.\n</div>\n\nIf you don’t want to read the preface, jump right to the tips.\n\n## Personal development and change in perspective\n\nWhen I made my first website my highest priority was to get content online. I didn’t care much about usability, accessibility, performance, UX or browser compatibility. Why would I? I made a robust table based layout and I offered a 800×600 and a 1024×768 version of my site. On top of that, I informed users that the website was optimized for Internet Explorer 5.\n\n![1*IKUahO-N2soQ5GCyhe3NfA](//images.contentful.com/zvi026ixizar/5QTpCw1LdC0IoSuoGGUKYs/617daa6e0ae2f4edae0515202d6a9fc4/1_IKUahO-N2soQ5GCyhe3NfA.png)\n\nThis was of course before I started to work professionally as a web designer and my perspective in what was important changed. \nYears later, instead of dictating the requirements for my websites, I started to optimize them for all major browsers. \nBeginning with [Ethan Marcotte’s game changing article](alistapart.com/article/responsive-web-design) I started caring about devices as well.\nMaking websites for all kinds or browsers and devices is great, but pretty much useless if the websites are too slow. So I learned everything about critical CSS, speed indices, font loading, CDNs and so on."},{"title":"Progressively Enhancing CSS Layout: From Floats To Flexbox To Grid","slug":"progressively-enhancing-css-layout-from-floats-to-flexbox-to-grid","teaser":"Earlier this year, support for CSS grid layout landed in most major desktop browsers. Naturally, the specification is one of the hot topics at meet-ups and conferences. After having some conversations about grid and progressive enhancement, I believe that there’s a good amount of uncertainty about using it. I heard some quite interesting questions and statements, which I want to address in this post.","date":"2017-07-24","year":"2017"}]